---
kind: property
id: P:Autodesk.Revit.DB.ImageView.ImageInstanceId
source: html/31e60b48-a972-80fc-89ed-559068c49dec.htm
---
# Autodesk.Revit.DB.ImageView.ImageInstanceId Property

Id of the image in the view.

## Syntax (C#)
```csharp
public ElementId ImageInstanceId { get; }
```